/////////////////////////////////////////////////////////////
/////////////////  Sensor (คำสั่งแสดงค่าเซนเซอร์) ///////////////
// ปรับ BuadRate -> 115200
// SerialSensor();
// -> Serial Monitor ค่าของเซนเซอร์ (ค่าดิบ)
// >>>> ค่าโดยประมาณ 40 - 800
// ==========================================================
// SerialCalibrateSensor();
// -> Serial Monitor ค่าของเซนเซอร์ (ค่าที่ Calibrate แล้ว)
// >>>> ค่าโดยประมาณ 0 - 1000
// ==========================================================
// CaliberateRobotSensor();
// -> Serial Monitor Calibrate ค่าแสงของหุ่นยนต์ (ทำในสนามครั้งเดียว)
// วิธีคาริเบทหุ่นยนต์
// 1) Upload คำสั่ง CaliberateRobotSensor();
// 2) เปิด Serial Monitor ให้แสดงคำว่า Ready
// 3) กดปุ่ม OK หรือ SW_B ถูหุ่นยนต์บนสนามผ่านเส้น ขาว-ดำ อย่างช้าๆ *ห้ามยกลอย*
// 4) คัดลอกค่า SensorValue ไปใส่ในหน้าแรก เสร็จสิ้น

/////////////////////////////////////////////////////////////
/////////////////  Move (คำสั่งเคลื่อนที่) ////////////////////////
// คำสั่งเคลื่อนที่ Move(ความเร็วมอเตอร์ซ้าย,ความเร็วมอเตอร์ขวา,เวลาที่ใช้);
// Speed -> ความเร็ว 0-100
// Time -> เวลาที่ใช้งาน หน่วย Millisecond >> 1000 = 1 วินาทีโดยประมาณ
// ==========================================================
// คำสั่งทดสอบมอเตอร์
// -> ซ้ายเดิน ขวาหยุด -> ซ้ายหยุด ขวาเดิน -> ซ้าย ขวา หยุด
// Move(30 , 0 , 500);
// Move(0 , 30 , 500);
// Move(0 , 0 , 500);
// ==========================================================


/////////////////////////////////////////////////////////////
/////////////////  TRACK TIME (วิ่งตามเส้นด้วยเวลา) //////////////
// Speed -> ความเร็ว 0-100
// KP -> ค่าเข้าโค้ง ยิ่งเพิ่มยิ่งเข้าโค้งไว (0.01 - 0.025)
// KD -> ค่าทำให้หุ่นนิ่ง ยิ่งเพิ่มยิ่งนิ่ง (0.08 - 0.5)
// Time -> เวลาที่ใช้งาน หน่วย Millisecond >> 1000 = 1 วินาทีโดยประมาณ
// ==========================================================
// ตัวอย่าง : TrackTime6(40, 0.01, 0.08, 1000);
// PID ด้วยเวลา TrackTime6(Speed, Kp , Kd, เวลา);
// >> ใช้เซนเซอร์จับเส้น 6 ตัวกลาง
//===========================================================
// ตัวอย่าง : TrackTime8(40, 0.01, 0.08, 1000);
// PID ด้วยเวลา TrackTime8(Speed, Kp , Kd, เวลา);
// >> ใช้เซนเซอร์จับเส้น 8 ตัวกลาง
//===========================================================
// ตัวอย่าง : TrackTime10(40, 0.01, 0.08, 1000);
// PID ด้วยเวลา TrackTime10(Speed, Kp , Kd, เวลา);
// >> ใช้เซนเซอร์จับเส้น 10 ตัวกลาง
//===========================================================
// ตัวอย่าง : TrackTime(40, 0.01, 0.08, 1000);
// PID ด้วยเวลา TrackTime(Speed, Kp , Kd, เวลา);
// >> ใช้เซนเซอร์จับเส้น 16 ตัวกลาง
//===========================================================
// ตัวอย่าง : TrackTime_Advance(10, 40, 0.01, 0.08, 1000);
// PID ด้วยเวลา TrackTime_Advance(จำนวนเซนเซอร์ที่จับเส้น, Speed, Kp , Kd, เวลา);
// >> ใช้เซนเซอร์จับเส้นตามที่กำหนด 6 , 8 , 10 , 16 ตัวตรวจจับ
//===========================================================
// ตัวอย่าง : TrackTime_DashLine(40, 0.01, 0.08, 1000);
// PID ด้วยเวลา TrackTime_DashLine(Speed, Kp , Kd, เวลา);
// >> ใช้เซนเซอร์จับเส้น 16 ตัวกลาง วิ่งตรงเมื่อเจอเส้นประหรือเส้นขาด
//===========================================================


/////////////////////////////////////////////////////////////
/////////////////  TRACK CROSS (วิ่งตามเส้นจนกว่าจะเจอเส้นตัด) /////
// Speed -> ความเร็ว 0-100
// KP -> ค่าเข้าโค้ง ยิ่งเพิ่มยิ่งเข้าโค้งไว (0.01 - 0.025)
// KD -> ค่าทำให้หุ่นนิ่ง ยิ่งเพิ่มยิ่งนิ่ง (0.08 - 0.5)
// คำสั่งเจอแยก >> 'l'=เลี้ยวซ้าย ,'r'=เลี้ยวขวา ,'p'=ตรง ,'s'=หยุด
//===========================================================
// TrackCrossL(40, 0.01, 0.08, 'r');  // ใช้เซนเซอร์คู่ซ้ายในการนับแยก
// TrackCrossR(40, 0.01, 0.08, 'r');  // ใช้เซนเซอร์คู่ขวาในการนับแยก
// TrackCrossC(40, 0.01, 0.08, 'r');  // ใช้เซนเซอร์คู่กลางในการนับแยก
//===========================================================
// ตัวอย่าง : TrackCrossC_Advance(10, 40, 0.01, 0.08, 'p');
// PID ด้วยเวลา TrackCrossC_Advance(จำนวนเซนเซอร์ที่จับเส้น, Speed, Kp , Kd, 'คำสั่งเจอแยก');
// >> ใช้เซนเซอร์จับเส้นตามที่กำหนด 6 , 8 , 10 , 16 ตัวตรวจจับ
//===========================================================
// ตัวอย่าง : TrackCrossC_DashLine(40, 0.01, 0.08,  'p');
// PID ด้วยเวลา TrackCrossC_DashLine(Speed, Kp , Kd, 'คำสั่งเจอแยก');
// >> ใช้เซนเซอร์จับเส้น 16 ตัวกลาง วิ่งตรงเมื่อเจอเส้นประหรือเส้นขาด
//===========================================================

