#define NUM_SENSORS 8  //จำนวนเซนเซอร์
uint8_t F_PIN[NUM_SENSORS] = { 0, 1, 2, 3, 4, 5, 6, 7 };
int F[NUM_SENSORS];
int REF[NUM_SENSORS];
int LastError;

///////////////////////////////////////////////////////////////////////////
// int MinValue[NUM_SENSORS] = {40,37,35,37,38,36,37,36};
// int MaxValue[NUM_SENSORS] = {909,659,824,870,855,815,857,740};
// int MinValue[NUM_SENSORS] = {35,35,36,35,39,36,35,34};
// int MaxValue[NUM_SENSORS] = {837,822,838,810,874,890,804,845};
int MinValue[NUM_SENSORS] = {35,34,35,34,38,36,34,34};
int MaxValue[NUM_SENSORS] = {891,868,844,870,867,883,840,875};
///////////////////////////////////////////////////////////////////////////

void setup() {
  Serial.begin(9600);BeginRobot();Go();delay(700);
  // ShowCalibrate();
  // SerialF();

  TrackTime(55, 0.03 , 0.4, 250); //ออกตัว

  // TrackTime(70, 0.0505, 0.6, 20000); //ศว.เก็บหมด v2

  // TrackTime(70, 0.0755, 0.6, 20000); //ศว.เก็บหมด v1 6.4

  // ==========================================================

  // TrackTime(85, 0.0935, 0.756, 20000); //ศว.เก็บหมด v7 6.37

  TrackTime(60, 0.14, 0.6, 20000); //ศว.เก็บหมด v6 6.35 //

  // TrackTime(85, 0.0933, 0.755, 20000); //ศว.เก็บหมด v5 6.44 6.34 6.38

  // TrackTime(85, 0.0935, 0.755, 20000); //ศว.เก็บหมด v4 6.49 6.38

  // TrackTime(85, 0.108, 0.735, 20000); //ศว.เก็บหมด v3 6.7 6.43

  // TrackTime(85, 0.115, 0.85, 20000); //ศว.เก็บหมด super v2 6.33 6.59

  // TrackTime(85, 0.105, 0.735, 20000); //ศว.เก็บหมด v1 6.58 6.4

  // MotorShot();
}

void loop() {

  MotorShot();
  STOP();
}
